tests/swagger/petstore-converted-all.yaml
---
execution:
- concurrency: 1
  hold-for: 1m
  scenario: Swagger-Petstore
scenarios:
  Swagger-Petstore:
    default-address: http://petstore.swagger.io
    requests:
    - label: updatePet
      method: PUT
      url: /v2/pet
    - label: addPet
      method: POST
      url: /v2/pet
    - label: findPetsByStatus
      url: /v2/pet/findByStatus?status=%5B42%5D
    - label: findPetsByTags
      url: /v2/pet/findByTags?tags=%5B42%5D
    - label: getPetById
      url: /v2/pet/13
    - label: updatePetWithForm
      method: POST
      url: /v2/pet/13
    - label: deletePet
      method: DELETE
      url: /v2/pet/13
    - label: uploadFile
      method: POST
      url: /v2/pet/13/uploadImage
    - label: getInventory
      url: /v2/store/inventory
    - label: placeOrder
      method: POST
      url: /v2/store/order
    - label: getOrderById
      url: /v2/store/order/13
    - label: deleteOrder
      method: DELETE
      url: /v2/store/order/13
    - label: createUser
      method: POST
      url: /v2/user
    - label: createUsersWithArrayInput
      method: POST
      url: /v2/user/createWithArray
    - label: createUsersWithListInput
      method: POST
      url: /v2/user/createWithList
    - label: loginUser
      url: /v2/user/login?username=string&password=string
    - label: logoutUser
      url: /v2/user/logout
    - label: getUserByName
      url: /v2/user/string
    - label: updateUser
      method: PUT
      url: /v2/user/string
    - label: deleteUser
      method: DELETE
      url: /v2/user/string